myWS/1_15503_FAM_INT_206_Uen_5_XML_Schema.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
	<SOAP-ENV:Body>
		<m:processProvisioning xmlns:m="http://ws.ipline.intech.com/">
			<MOVEMENT>
				<CALL_WAITING>String</CALL_WAITING>
				<CFB>
					<ACTIVE>String</ACTIVE>
					<CFB_ANNOUNCEMENT>String</CFB_ANNOUNCEMENT>
					<CFB_ANNOUNCEMENT_NUM>String</CFB_ANNOUNCEMENT_NUM>
					<CFB_ATTENDANT>String</CFB_ATTENDANT>
					<CFB_NUMBER>String</CFB_NUMBER>
					<CFB_VOICE_MAIL>String</CFB_VOICE_MAIL>
				</CFB>
				<CFFM>
					<ACTIVE>String</ACTIVE>
					<CFFM_INFO>
						<CFFM_NUMBER>String</CFFM_NUMBER>
						<CFFM_RING_SEQUEN>String</CFFM_RING_SEQUEN>
						<CFFM_RING_SIMULT>String</CFFM_RING_SIMULT>
						<CFFM_RING_TIMER>String</CFFM_RING_TIMER>
						<CFFM_TARGET>String</CFFM_TARGET>
						<CFFM_TYPE>String</CFFM_TYPE>
						<CFFM_VM>String</CFFM_VM>
						<END_TIME>String</END_TIME>
						<START_TIME>String</START_TIME>
						<WEEK_DAYS>0</WEEK_DAYS>
					</CFFM_INFO>
				</CFFM>
				<CFNA>
					<ACTIVE>String</ACTIVE>
					<CFNA_ANNOUNCEMENT>String</CFNA_ANNOUNCEMENT>
					<CFNA_ANNOUNCEMENT_NUM>String</CFNA_ANNOUNCEMENT_NUM>
					<CFNA_ATTENDANT>String</CFNA_ATTENDANT>
					<CFNA_NUMBER>String</CFNA_NUMBER>
					<CFNA_TIMER>String</CFNA_TIMER>
					<CFNA_VOICE_MAIL>String</CFNA_VOICE_MAIL>
				</CFNA>
				<CFU>
					<ACTIVE>String</ACTIVE>
					<CFU_ANNOUNCEMENT>String</CFU_ANNOUNCEMENT>
					<CFU_ANNOUNCEMENT_NUM>String</CFU_ANNOUNCEMENT_NUM>
					<CFU_ATTENDANT>String</CFU_ATTENDANT>
					<CFU_NUMBER>String</CFU_NUMBER>
					<CFU_VOICE_MAIL>String</CFU_VOICE_MAIL>
				</CFU>
				<COMPANY>
					<ACTIVE>String</ACTIVE>
					<ADDRESS>String</ADDRESS>
					<BUSINESS_COMPANY>String</BUSINESS_COMPANY>
					<CITY>String</CITY>
					<CODE>String</CODE>
					<COMPANY_ADMIN>
						<ACTIVE>String</ACTIVE>
						<LAST_NAME>String</LAST_NAME>
						<LOGIN>String</LOGIN>
						<NAME>String</NAME>
						<PASSWORD>String</PASSWORD>
					</COMPANY_ADMIN>
					<COMPANY_PROVIDER>
						<CODE>String</CODE>
						<CONTACT>String</CONTACT>
						<EMAIL>String</EMAIL>
						<NAME>String</NAME>
						<PHONE_NUMBER>String</PHONE_NUMBER>
						<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
					</COMPANY_PROVIDER>
					<CONTACT>String</CONTACT>
					<CONTACT_EMAIL>String</CONTACT_EMAIL>
					<COUNTRY>String</COUNTRY>
					<FISCAL_IDENTIFICATOR>String</FISCAL_IDENTIFICATOR>
					<NUMBERS>
						<ACTION>String</ACTION>
						<FIRST_NUMBER>String</FIRST_NUMBER>
						<LAST_NUMBER>String</LAST_NUMBER>
						<PROVIDER_CODE>String</PROVIDER_CODE>
					</NUMBERS>
					<PACKAGES_NAME>String</PACKAGES_NAME>
					<PHONE>String</PHONE>
					<STATE>String</STATE>
					<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
					<ZIP_CODE>String</ZIP_CODE>
				</COMPANY>
				<CUSTOM_FEATURES>
					<CUSTOM_FEATURE>
						<NAME>String</NAME>
						<PROPERTIES>
							<PROPERTY>
								<entry>
									<key>String</key>
									<value>String</value>
								</entry>
							</PROPERTY>
						</PROPERTIES>
					</CUSTOM_FEATURE>
				</CUSTOM_FEATURES>
				<EXTENSION>
					<CODE>String</CODE>
					<EXTENSION_MAIN_NUMBER>
						<CODE>String</CODE>
						<NUMBER_COMPANY>
							<ACTIVE>String</ACTIVE>
							<ADDRESS>String</ADDRESS>
							<BUSINESS_COMPANY>String</BUSINESS_COMPANY>
							<CITY>String</CITY>
							<CODE>String</CODE>
							<COMPANY_ADMIN>
								<ACTIVE>String</ACTIVE>
								<LAST_NAME>String</LAST_NAME>
								<LOGIN>String</LOGIN>
								<NAME>String</NAME>
								<PASSWORD>String</PASSWORD>
							</COMPANY_ADMIN>
							<COMPANY_PROVIDER>
								<CODE>String</CODE>
								<CONTACT>String</CONTACT>
								<EMAIL>String</EMAIL>
								<NAME>String</NAME>
								<PHONE_NUMBER>String</PHONE_NUMBER>
								<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
							</COMPANY_PROVIDER>
							<CONTACT>String</CONTACT>
							<CONTACT_EMAIL>String</CONTACT_EMAIL>
							<COUNTRY>String</COUNTRY>
							<FISCAL_IDENTIFICATOR>String</FISCAL_IDENTIFICATOR>
							<NUMBERS>
								<ACTION>String</ACTION>
								<FIRST_NUMBER>String</FIRST_NUMBER>
								<LAST_NUMBER>String</LAST_NUMBER>
								<PROVIDER_CODE>String</PROVIDER_CODE>
							</NUMBERS>
							<PACKAGES_NAME>String</PACKAGES_NAME>
							<PHONE>String</PHONE>
							<STATE>String</STATE>
							<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
							<ZIP_CODE>String</ZIP_CODE>
						</NUMBER_COMPANY>
						<NUMBER_PROVIDER>
							<CODE>String</CODE>
							<CONTACT>String</CONTACT>
							<EMAIL>String</EMAIL>
							<NAME>String</NAME>
							<PHONE_NUMBER>String</PHONE_NUMBER>
							<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
						</NUMBER_PROVIDER>
						<STATUS_LINE>String</STATUS_LINE>
					</EXTENSION_MAIN_NUMBER>
					<EXTENSION_NUMBER>
						<CODE>String</CODE>
						<NUMBER_COMPANY>
							<ACTIVE>String</ACTIVE>
							<ADDRESS>String</ADDRESS>
							<BUSINESS_COMPANY>String</BUSINESS_COMPANY>
							<CITY>String</CITY>
							<CODE>String</CODE>
							<COMPANY_ADMIN>
								<ACTIVE>String</ACTIVE>
								<LAST_NAME>String</LAST_NAME>
								<LOGIN>String</LOGIN>
								<NAME>String</NAME>
								<PASSWORD>String</PASSWORD>
							</COMPANY_ADMIN>
							<COMPANY_PROVIDER>
								<CODE>String</CODE>
								<CONTACT>String</CONTACT>
								<EMAIL>String</EMAIL>
								<NAME>String</NAME>
								<PHONE_NUMBER>String</PHONE_NUMBER>
								<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
							</COMPANY_PROVIDER>
							<CONTACT>String</CONTACT>
							<CONTACT_EMAIL>String</CONTACT_EMAIL>
							<COUNTRY>String</COUNTRY>
							<FISCAL_IDENTIFICATOR>String</FISCAL_IDENTIFICATOR>
							<NUMBERS>
								<ACTION>String</ACTION>
								<FIRST_NUMBER>String</FIRST_NUMBER>
								<LAST_NUMBER>String</LAST_NUMBER>
								<PROVIDER_CODE>String</PROVIDER_CODE>
							</NUMBERS>
							<PACKAGES_NAME>String</PACKAGES_NAME>
							<PHONE>String</PHONE>
							<STATE>String</STATE>
							<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
							<ZIP_CODE>String</ZIP_CODE>
						</NUMBER_COMPANY>
						<NUMBER_PROVIDER>
							<CODE>String</CODE>
							<CONTACT>String</CONTACT>
							<EMAIL>String</EMAIL>
							<NAME>String</NAME>
							<PHONE_NUMBER>String</PHONE_NUMBER>
							<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
						</NUMBER_PROVIDER>
						<STATUS_LINE>String</STATUS_LINE>
					</EXTENSION_NUMBER>
					<EXTENSION_PACKAGE>
						<ACTIVE>String</ACTIVE>
						<FEATURES>String</FEATURES>
						<PACKAGE_DESCRIPTION>String</PACKAGE_DESCRIPTION>
						<PACKAGE_NAME>String</PACKAGE_NAME>
						<PROVIDER_CODE>String</PROVIDER_CODE>
					</EXTENSION_PACKAGE>
					<EXTENSION_SITE>
						<CODE>String</CODE>
						<SITE_ASL>String</SITE_ASL>
						<SITE_COMPANY>
							<ACTIVE>String</ACTIVE>
							<ADDRESS>String</ADDRESS>
							<BUSINESS_COMPANY>String</BUSINESS_COMPANY>
							<CITY>String</CITY>
							<CODE>String</CODE>
							<COMPANY_ADMIN>
								<ACTIVE>String</ACTIVE>
								<LAST_NAME>String</LAST_NAME>
								<LOGIN>String</LOGIN>
								<NAME>String</NAME>
								<PASSWORD>String</PASSWORD>
							</COMPANY_ADMIN>
							<COMPANY_PROVIDER>
								<CODE>String</CODE>
								<CONTACT>String</CONTACT>
								<EMAIL>String</EMAIL>
								<NAME>String</NAME>
								<PHONE_NUMBER>String</PHONE_NUMBER>
								<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
							</COMPANY_PROVIDER>
							<CONTACT>String</CONTACT>
							<CONTACT_EMAIL>String</CONTACT_EMAIL>
							<COUNTRY>String</COUNTRY>
							<FISCAL_IDENTIFICATOR>String</FISCAL_IDENTIFICATOR>
							<NUMBERS>
								<ACTION>String</ACTION>
								<FIRST_NUMBER>String</FIRST_NUMBER>
								<LAST_NUMBER>String</LAST_NUMBER>
								<PROVIDER_CODE>String</PROVIDER_CODE>
							</NUMBERS>
							<PACKAGES_NAME>String</PACKAGES_NAME>
							<PHONE>String</PHONE>
							<STATE>String</STATE>
							<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
							<ZIP_CODE>String</ZIP_CODE>
						</SITE_COMPANY>
						<SITE_DESCRIPTION>String</SITE_DESCRIPTION>
						<SITE_NAME>String</SITE_NAME>
						<SITE_PACKAGE>
							<ACTIVE>String</ACTIVE>
							<FEATURES>String</FEATURES>
							<PACKAGE_DESCRIPTION>String</PACKAGE_DESCRIPTION>
							<PACKAGE_NAME>String</PACKAGE_NAME>
							<PROVIDER_CODE>String</PROVIDER_CODE>
						</SITE_PACKAGE>
						<SITE_SERVER_FAX>String</SITE_SERVER_FAX>
					</EXTENSION_SITE>
					<EXTENSION_USER>
						<ACTIVE>String</ACTIVE>
						<LAST_NAME>String</LAST_NAME>
						<LOGIN>String</LOGIN>
						<NAME>String</NAME>
						<PASSWORD>String</PASSWORD>
					</EXTENSION_USER>
					<MAIN_LINE>String</MAIN_LINE>
					<OPERATOR>String</OPERATOR>
				</EXTENSION>
				<HUNT_GROUP>
					<ACTIVE>String</ACTIVE>
					<HUNTGROUP_INFO>
						<HUNTGROUP_NUMBER>String</HUNTGROUP_NUMBER>
						<HUNTGROUP_RING>String</HUNTGROUP_RING>
					</HUNTGROUP_INFO>
					<HUNTGROUP_TYPE>String</HUNTGROUP_TYPE>
				</HUNT_GROUP>
				<ICB>
					<ACTIVE>String</ACTIVE>
					<ICB_BL>String</ICB_BL>
					<ICB_WL>String</ICB_WL>
				</ICB>
				<LINE_TYPE>String</LINE_TYPE>
				<MOV_DETA>String</MOV_DETA>
				<MOV_TYPE>String</MOV_TYPE>
				<MULTISITE>String</MULTISITE>
				<NIP_CALL_REST>
					<NIP_CALL_REST_ACT>String</NIP_CALL_REST_ACT>
					<NIP_CALL_REST_BLOQ>String</NIP_CALL_REST_BLOQ>
					<NIP_CALL_REST_NUM>String</NIP_CALL_REST_NUM>
				</NIP_CALL_REST>
				<NUMBERS>
					<ACTION>String</ACTION>
					<FIRST_NUMBER>String</FIRST_NUMBER>
					<LAST_NUMBER>String</LAST_NUMBER>
					<PROVIDER_CODE>String</PROVIDER_CODE>
				</NUMBERS>
				<OCB>
					<ACTIVE>String</ACTIVE>
					<OCB_1800>String</OCB_1800>
					<OCB_1801>String</OCB_1801>
					<OCB_BL>String</OCB_BL>
					<OCB_INT>String</OCB_INT>
					<OCB_LOC>String</OCB_LOC>
					<OCB_MOB>String</OCB_MOB>
					<OCB_NAT>String</OCB_NAT>
					<OCB_REST_UNLOCK>String</OCB_REST_UNLOCK>
					<OCB_WL>String</OCB_WL>
				</OCB>
				<OFFNET>String</OFFNET>
				<OFFNET_SIM_CALLS>String</OFFNET_SIM_CALLS>
				<ORIGINAL_COMPANY>String</ORIGINAL_COMPANY>
				<OUTGOINGCALLBARRING>
					<OUTGOINGCALLBARRING_INFO>
						<OUTGOINGCALLBARRING_ACTIVE>String</OUTGOINGCALLBARRING_ACTIVE>
						<OUTGOINGCALLBARRING_NUMBERS>String</OUTGOINGCALLBARRING_NUMBERS>
					</OUTGOINGCALLBARRING_INFO>
					<OWNER_CODE>String</OWNER_CODE>
					<PROVIDER_CODE>String</PROVIDER_CODE>
					<PROVIDER_OWNER_CODE>String</PROVIDER_OWNER_CODE>
				</OUTGOINGCALLBARRING>
				<PACKAGE>
					<ACTIVE>String</ACTIVE>
					<FEATURES>String</FEATURES>
					<PACKAGE_DESCRIPTION>String</PACKAGE_DESCRIPTION>
					<PACKAGE_NAME>String</PACKAGE_NAME>
					<PROVIDER_CODE>String</PROVIDER_CODE>
				</PACKAGE>
				<PRIVATE_NUMBER>String</PRIVATE_NUMBER>
				<PUBLIC_NUMBER>String</PUBLIC_NUMBER>
				<SERVICE_PROVIDER>String</SERVICE_PROVIDER>
				<SITE>
					<CODE>String</CODE>
					<SITE_ASL>String</SITE_ASL>
					<SITE_COMPANY>
						<ACTIVE>String</ACTIVE>
						<ADDRESS>String</ADDRESS>
						<BUSINESS_COMPANY>String</BUSINESS_COMPANY>
						<CITY>String</CITY>
						<CODE>String</CODE>
						<COMPANY_ADMIN>
							<ACTIVE>String</ACTIVE>
							<LAST_NAME>String</LAST_NAME>
							<LOGIN>String</LOGIN>
							<NAME>String</NAME>
							<PASSWORD>String</PASSWORD>
						</COMPANY_ADMIN>
						<COMPANY_PROVIDER>
							<CODE>String</CODE>
							<CONTACT>String</CONTACT>
							<EMAIL>String</EMAIL>
							<NAME>String</NAME>
							<PHONE_NUMBER>String</PHONE_NUMBER>
							<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
						</COMPANY_PROVIDER>
						<CONTACT>String</CONTACT>
						<CONTACT_EMAIL>String</CONTACT_EMAIL>
						<COUNTRY>String</COUNTRY>
						<FISCAL_IDENTIFICATOR>String</FISCAL_IDENTIFICATOR>
						<NUMBERS>
							<ACTION>String</ACTION>
							<FIRST_NUMBER>String</FIRST_NUMBER>
							<LAST_NUMBER>String</LAST_NUMBER>
							<PROVIDER_CODE>String</PROVIDER_CODE>
						</NUMBERS>
						<PACKAGES_NAME>String</PACKAGES_NAME>
						<PHONE>String</PHONE>
						<STATE>String</STATE>
						<SUPPORT_EMAIL>String</SUPPORT_EMAIL>
						<ZIP_CODE>String</ZIP_CODE>
					</SITE_COMPANY>
					<SITE_DESCRIPTION>String</SITE_DESCRIPTION>
					<SITE_NAME>String</SITE_NAME>
					<SITE_PACKAGE>
						<ACTIVE>String</ACTIVE>
						<FEATURES>String</FEATURES>
						<PACKAGE_DESCRIPTION>String</PACKAGE_DESCRIPTION>
						<PACKAGE_NAME>String</PACKAGE_NAME>
						<PROVIDER_CODE>String</PROVIDER_CODE>
					</SITE_PACKAGE>
					<SITE_SERVER_FAX>String</SITE_SERVER_FAX>
				</SITE>
				<THREEWAY_CALL>String</THREEWAY_CALL>
				<USER>
					<ACTIVE>String</ACTIVE>
					<LAST_NAME>String</LAST_NAME>
					<LOGIN>String</LOGIN>
					<NAME>String</NAME>
					<PASSWORD>String</PASSWORD>
				</USER>
				<VOICE_MAIL>
					<ACTIVE>String</ACTIVE>
					<VOICE_MAIL_BUSY>String</VOICE_MAIL_BUSY>
					<VOICE_MAIL_EMAIL>String</VOICE_MAIL_EMAIL>
					<VOICE_MAIL_IMMED>String</VOICE_MAIL_IMMED>
					<VOICE_MAIL_NANSW>String</VOICE_MAIL_NANSW>
					<VOICE_MAIL_NUM>String</VOICE_MAIL_NUM>
					<VOICE_MAIL_TIMER>String</VOICE_MAIL_TIMER>
				</VOICE_MAIL>
			</MOVEMENT>
		</m:processProvisioning>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
